# # 1) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ for ციკლის ჩათვლით 0 დან შემოტანილი რიცხვის ჩათვლით უნდა იპოვნოთ 3სა და 5ის ჯერადი რიცხვები (ანუ ის რიცხვები რომელბიც იყოფა 3ზეც და 5ზეც) ნაპოვნი რიცხვები კი დაბეჭდეთ

number = int(input("Enter a number: "))
for i in range(0, number + 1):
  if i % 3 == 0 and i % 5 == 0:
    print(i)


# # 2) მომხმარებელს შემოატანინეთ რიცხვი, თქვენი დავალებაა for ციკლის მეშვეობით 0_დან მაგ რიცხვის ჩათვლით ყველა რიცხვის ჯამი გამოითვალოთ და დაბეჭდოთ ტერმინალში
num = int(input("Enter a number: "))
total = 0
for i in range(0, num+1):
  total += i
print(total)


# 3) შექმენით while ციკლი და დაბეჭდეთ 10 დან 0 ის ჩათვლით ციფრები.
count = 0
while count < 10:
  count += 1
  print(count)


# 4) მომხმარებლს შემოატანინეთ რიცხვი, 0 დან მაგ რიცხვის ჩათვლით გამოითვალეთ იმ რიცხვების ჯამი რომლებიც იყოფა 3 ზე 
sum = 0
user_input = int(input("Enter a number: "))

for i in range(0, user_input+1):
  if i % 3 == 0:
    sum += i
print(i)